jonahn/EE478/Lab2/PIC_SOURCES/h/p18f87j94.h
extern volatile far  unsigned char       RPINR38_39;
extern volatile far  union {
  struct {
    unsigned CCP10R:4;
    unsigned T0CKIR:4;
  };
  struct {
    unsigned CCP10R0:1;
    unsigned CCP10R1:1;
    unsigned CCP10R2:1;
    unsigned CCP10R3:1;
    unsigned T0CKIR0:1;
    unsigned T0CKIR1:1;
    unsigned T0CKIR2:1;
    unsigned T0CKIR3:1;
  };
} RPINR38_39bits;
extern volatile far  unsigned char       RPINR40_41;
extern volatile far  union {
  struct {
    unsigned T1GR:4;
    unsigned T1CKIR:4;
  };
  struct {
    unsigned T1GR0:1;
    unsigned T1GR1:1;
    unsigned T1GR2:1;
    unsigned T1GR3:1;
    unsigned T1CKIR0:1;
    unsigned T1CKIR1:1;
    unsigned T1CKIR2:1;
    unsigned T1CKIR3:1;
  };
} RPINR40_41bits;
extern volatile far  unsigned char       RPINR42_43;
extern volatile far  union {
  struct {
    unsigned T3GR:4;
    unsigned T3CKIR:4;
  };
  struct {
    unsigned T3GR0:1;
    unsigned T3GR1:1;
    unsigned T3GR2:1;
    unsigned T3GR3:1;
    unsigned T3CKIR0:1;
    unsigned T3CKIR1:1;
    unsigned T3CKIR2:1;
    unsigned T3CKIR3:1;
  };
} RPINR42_43bits;
extern volatile far  unsigned char       RPINR44_45;
extern volatile far  union {
  struct {
    unsigned T5GR:4;
    unsigned T5CKIR:4;
  };
  struct {
    unsigned T5GR0:1;
    unsigned T5GR1:1;
    unsigned T5GR2:1;
    unsigned T5GR3:1;
    unsigned T5CKIR0:1;
    unsigned T5CKIR1:1;
    unsigned T5CKIR2:1;
    unsigned T5CKIR3:1;
  };
} RPINR44_45bits;
extern volatile far  unsigned char       RPINR46_47;
extern volatile far  union {
  struct {
    unsigned PBIO0R:4;
    unsigned PBIO1R:4;
  };
  struct {
    unsigned PBIO0R0:1;
    unsigned PBIO0R1:1;
    unsigned PBIO0R2:1;
    unsigned PBIO0R3:1;
    unsigned PBIO1R0:1;
    unsigned PBIO1R1:1;
    unsigned PBIO1R2:1;
    unsigned PBIO1R3:1;
  };
} RPINR46_47bits;
extern volatile far  unsigned char       RPINR48_49;
extern volatile far  union {
  struct {
    unsigned PBIO2R:4;
    unsigned PBIO3R:4;
  };
  struct {
    unsigned PBIO2R0:1;
    unsigned PBIO2R1:1;
    unsigned PBIO2R2:1;
    unsigned PBIO2R3:1;
    unsigned PBIO3R0:1;
    unsigned PBIO3R1:1;
    unsigned PBIO3R2:1;
    unsigned PBIO3R3:1;
  };
} RPINR48_49bits;
extern volatile far  unsigned char       RPINR50_51;
extern volatile far  union {
  struct {
    unsigned PBIO4R:4;
    unsigned PBIO5R:4;
  };
  struct {
    unsigned PBIO4R0:1;
    unsigned PBIO4R1:1;
    unsigned PBIO4R2:1;
    unsigned PBIO4R3:1;
    unsigned PBIO5R0:1;
    unsigned PBIO5R1:1;
    unsigned PBIO5R2:1;
    unsigned PBIO5R3:1;
  };
} RPINR50_51bits;
extern volatile far  unsigned char       RPINR52_53;
extern volatile far  union {
  struct {
    unsigned PBIO6R:4;
    unsigned PBIO7R:4;
  };
  struct {
    unsigned PBIO6R0:1;
    unsigned PBIO6R1:1;
    unsigned PBIO6R2:1;
    unsigned PBIO6R3:1;
    unsigned PBIO7R0:1;
    unsigned PBIO7R1:1;
    unsigned PBIO7R2:1;
    unsigned PBIO7R3:1;
  };
} RPINR52_53bits;
extern volatile far  unsigned char       ANCON3;
extern volatile far  struct {
  unsigned ANSEL16:1;
  unsigned ANSEL17:1;
  unsigned ANSEL18:1;
  unsigned ANSEL19:1;
  unsigned ANSEL20:1;
  unsigned ANSEL21:1;
  unsigned ANSEL22:1;
  unsigned ANSEL23:1;
} ANCON3bits;
extern volatile far  unsigned char       ANCON2;
extern volatile far  struct {
  unsigned ANSEL8:1;
  unsigned ANSEL9:1;
  unsigned ANSEL10:1;
  unsigned ANSEL11:1;
  unsigned ANSEL12:1;
  unsigned ANSEL13:1;
  unsigned ANSEL14:1;
  unsigned ANSEL15:1;
} ANCON2bits;
extern volatile far  unsigned char       ANCON1;
extern volatile far  struct {
  unsigned ANSEL0:1;
  unsigned ANSEL1:1;
  unsigned ANSEL2:1;
  unsigned ANSEL3:1;
  unsigned ANSEL4:1;
  unsigned ANSEL5:1;
  unsigned ANSEL6:1;
  unsigned ANSEL7:1;
} ANCON1bits;
extern volatile far  unsigned            ADCBUF1;
extern volatile far  unsigned char       ADCBUF1L;
extern volatile far  unsigned char       ADCBUF1H;
extern volatile far  unsigned            ADCBUF2;
extern volatile far  unsigned char       ADCBUF2L;
extern volatile far  unsigned char       ADCBUF2H;
extern volatile far  unsigned            ADCBUF3;
extern volatile far  unsigned char       ADCBUF3L;
extern volatile far  unsigned char       ADCBUF3H;
extern volatile far  unsigned            ADCBUF4;
extern volatile far  unsigned char       ADCBUF4L;
extern volatile far  unsigned char       ADCBUF4H;
extern volatile far  unsigned            ADCBUF5;
extern volatile far  unsigned char       ADCBUF5L;
extern volatile far  unsigned char       ADCBUF5H;
extern volatile far  unsigned            ADCBUF6;
extern volatile far  unsigned char       ADCBUF6L;
extern volatile far  unsigned char       ADCBUF6H;
extern volatile far  unsigned            ADCBUF7;
extern volatile far  unsigned char       ADCBUF7L;
extern volatile far  unsigned char       ADCBUF7H;
extern volatile far  unsigned            ADCBUF8;
extern volatile far  unsigned char       ADCBUF8L;
extern volatile far  unsigned char       ADCBUF8H;
extern volatile far  unsigned            ADCBUF9;
extern volatile far  unsigned char       ADCBUF9L;
extern volatile far  unsigned char       ADCBUF9H;
extern volatile far  unsigned            ADCBUF10;
extern volatile far  unsigned char       ADCBUF10L;
extern volatile far  unsigned char       ADCBUF10H;
extern volatile far  unsigned            ADCBUF11;
extern volatile far  unsigned char       ADCBUF11L;
extern volatile far  unsigned char       ADCBUF11H;
extern volatile far  unsigned            ADCBUF12;
extern volatile far  unsigned char       ADCBUF12L;
extern volatile far  unsigned char       ADCBUF12H;
extern volatile far  unsigned            ADCBUF13;
extern volatile far  unsigned char       ADCBUF13L;
extern volatile far  unsigned char       ADCBUF13H;
extern volatile far  unsigned            ADCBUF14;
extern volatile far  unsigned char       ADCBUF14L;
extern volatile far  unsigned char       ADCBUF14H;
extern volatile far  unsigned            ADCBUF15;
extern volatile far  unsigned char       ADCBUF15L;
extern volatile far  unsigned char       ADCBUF15H;
extern volatile far  unsigned            ADCBUF16;
extern volatile far  unsigned char       ADCBUF16L;
extern volatile far  unsigned char       ADCBUF16H;
extern volatile far  unsigned            ADCBUF17;
extern volatile far  unsigned char       ADCBUF17L;
extern volatile far  unsigned char       ADCBUF17H;
extern volatile far  unsigned            ADCBUF18;
extern volatile far  unsigned char       ADCBUF18L;
extern volatile far  unsigned char       ADCBUF18H;
extern volatile far  unsigned            ADCBUF19;
extern volatile far  unsigned char       ADCBUF19L;
extern volatile far  unsigned char       ADCBUF19H;
extern volatile far  unsigned            ADCBUF20;
extern volatile far  unsigned char       ADCBUF20L;
extern volatile far  unsigned char       ADCBUF20H;
extern volatile far  unsigned            ADCBUF21;
extern volatile far  unsigned char       ADCBUF21L;
extern volatile far  unsigned char       ADCBUF21H;
extern volatile far  unsigned            ADCBUF22;
extern volatile far  unsigned char       ADCBUF22L;
extern volatile far  unsigned char       ADCBUF22H;
extern volatile far  unsigned            ADCBUF23;
extern volatile far  unsigned char       ADCBUF23L;
extern volatile far  unsigned char       ADCBUF23H;
extern volatile far  unsigned            ADCBUF24;
extern volatile far  unsigned char       ADCBUF24L;
extern volatile far  unsigned char       ADCBUF24H;
extern volatile far  unsigned            ADCBUF25;
extern volatile far  unsigned char       ADCBUF25L;
extern volatile far  unsigned char       ADCBUF25H;
extern volatile far  unsigned char       ADCTMUEN0L;
extern volatile far  union {
  struct {
    unsigned CTMUEN:8;
  };
  struct {
    unsigned CTMUEN0:1;
    unsigned CTMUEN1:1;
    unsigned CTMUEN2:1;
    unsigned CTMUEN3:1;
    unsigned CTMUEN4:1;
    unsigned CTMUEN5:1;
    unsigned CTMUEN6:1;
    unsigned CTMUEN7:1;
  };
} ADCTMUEN0Lbits;
extern volatile far  unsigned char       ADCTMUEN0H;
extern volatile far  union {
  struct {
    unsigned CTMUEN:8;
  };
  struct {
    unsigned CTMUEN8:1;
    unsigned CTMUEN9:1;
    unsigned CTMUEN10:1;
    unsigned CTMUEN11:1;
    unsigned CTMUEN12:1;
    unsigned CTMUEN13:1;
    unsigned CTMUEN14:1;
    unsigned CTMUEN15:1;
  };
} ADCTMUEN0Hbits;
