jonahn/EE478/Lab2/PIC_SOURCES/h/p18f87j94.h
extern volatile far  unsigned char       LCDDATA31;
extern volatile far  struct {
  unsigned S56C3:1;
  unsigned S57C3:1;
  unsigned S58C3:1;
  unsigned S59C3:1;
  unsigned S60C3:1;
  unsigned S61C3:1;
  unsigned S62C3:1;
  unsigned S63C3:1;
} LCDDATA31bits;
extern volatile far  unsigned char       LCDDATA32;
extern volatile far  struct {
  unsigned S00C4:1;
  unsigned S01C4:1;
  unsigned S02C4:1;
  unsigned S03C4:1;
  unsigned S04C4:1;
  unsigned S05C4:1;
  unsigned S06C4:1;
  unsigned S07C4:1;
} LCDDATA32bits;
extern volatile far  unsigned char       LCDDATA33;
extern volatile far  struct {
  unsigned S08C4:1;
  unsigned S09C4:1;
  unsigned S10C4:1;
  unsigned S11C4:1;
  unsigned S12C4:1;
  unsigned S13C4:1;
  unsigned S14C4:1;
  unsigned S15C4:1;
} LCDDATA33bits;
extern volatile far  unsigned char       LCDDATA34;
extern volatile far  struct {
  unsigned S16C4:1;
  unsigned S17C4:1;
  unsigned S18C4:1;
  unsigned S19C4:1;
  unsigned S20C4:1;
  unsigned S21C4:1;
  unsigned S22C4:1;
  unsigned S23C4:1;
} LCDDATA34bits;
extern volatile far  unsigned char       LCDDATA35;
extern volatile far  struct {
  unsigned S24C4:1;
  unsigned S25C4:1;
  unsigned S26C4:1;
  unsigned S27C4:1;
  unsigned S28C4:1;
  unsigned S29C4:1;
  unsigned S30C4:1;
  unsigned S31C4:1;
} LCDDATA35bits;
extern volatile far  unsigned char       LCDDATA36;
extern volatile far  struct {
  unsigned S32C4:1;
  unsigned S33C4:1;
  unsigned S34C4:1;
  unsigned S35C4:1;
  unsigned S36C4:1;
  unsigned S37C4:1;
  unsigned S38C4:1;
  unsigned S39C4:1;
} LCDDATA36bits;
extern volatile far  unsigned char       LCDDATA37;
extern volatile far  struct {
  unsigned S40C4:1;
  unsigned S41C4:1;
  unsigned S42C4:1;
  unsigned S43C4:1;
  unsigned S44C4:1;
  unsigned S45C4:1;
  unsigned S46C4:1;
  unsigned S47C4:1;
} LCDDATA37bits;
extern volatile far  unsigned char       LCDDATA38;
extern volatile far  struct {
  unsigned S48C4:1;
  unsigned S49C4:1;
  unsigned S50C4:1;
  unsigned S51C4:1;
  unsigned S52C4:1;
  unsigned S53C4:1;
  unsigned S54C4:1;
  unsigned S55C4:1;
} LCDDATA38bits;
extern volatile far  unsigned char       LCDDATA39;
extern volatile far  struct {
  unsigned S56C4:1;
  unsigned S57C4:1;
  unsigned S58C4:1;
  unsigned S59C4:1;
  unsigned S60C4:1;
  unsigned S61C4:1;
  unsigned S62C4:1;
  unsigned S63C4:1;
} LCDDATA39bits;
extern volatile far  unsigned char       LCDDATA40;
extern volatile far  struct {
  unsigned S00C5:1;
  unsigned S01C5:1;
  unsigned S02C5:1;
  unsigned S03C5:1;
  unsigned S04C5:1;
  unsigned S05C5:1;
  unsigned S06C5:1;
  unsigned S07C5:1;
} LCDDATA40bits;
extern volatile far  unsigned char       LCDDATA41;
extern volatile far  struct {
  unsigned S08C5:1;
  unsigned S09C5:1;
  unsigned S10C5:1;
  unsigned S11C5:1;
  unsigned S12C5:1;
  unsigned S13C5:1;
  unsigned S14C5:1;
  unsigned S15C5:1;
} LCDDATA41bits;
extern volatile far  unsigned char       LCDDATA42;
extern volatile far  struct {
  unsigned S16C5:1;
  unsigned S17C5:1;
  unsigned S18C5:1;
  unsigned S19C5:1;
  unsigned S20C5:1;
  unsigned S21C5:1;
  unsigned S22C5:1;
  unsigned S23C5:1;
} LCDDATA42bits;
extern volatile far  unsigned char       LCDDATA43;
extern volatile far  struct {
  unsigned S24C5:1;
  unsigned S25C5:1;
  unsigned S26C5:1;
  unsigned S27C5:1;
  unsigned S28C5:1;
  unsigned S29C5:1;
  unsigned S30C5:1;
  unsigned S31C5:1;
} LCDDATA43bits;
extern volatile far  unsigned char       LCDDATA44;
extern volatile far  struct {
  unsigned S32C5:1;
  unsigned S33C5:1;
  unsigned S34C5:1;
  unsigned S35C5:1;
  unsigned S36C5:1;
  unsigned S37C5:1;
  unsigned S38C5:1;
  unsigned S39C5:1;
} LCDDATA44bits;
extern volatile far  unsigned char       LCDDATA45;
extern volatile far  struct {
  unsigned S40C5:1;
  unsigned S41C5:1;
  unsigned S42C5:1;
  unsigned S43C5:1;
  unsigned S44C5:1;
  unsigned S45C5:1;
  unsigned S46C5:1;
  unsigned S47C5:1;
} LCDDATA45bits;
extern volatile far  unsigned char       LCDDATA46;
extern volatile far  struct {
  unsigned S48C5:1;
  unsigned S49C5:1;
  unsigned S50C5:1;
  unsigned S51C5:1;
  unsigned S52C5:1;
  unsigned S53C5:1;
  unsigned S54C5:1;
  unsigned S55C5:1;
} LCDDATA46bits;
extern volatile far  unsigned char       LCDDATA47;
extern volatile far  struct {
  unsigned S56C5:1;
  unsigned S57C5:1;
  unsigned S58C5:1;
  unsigned S59C5:1;
  unsigned S60C5:1;
  unsigned S61C5:1;
  unsigned S62C5:1;
  unsigned S63C5:1;
} LCDDATA47bits;
extern volatile far  unsigned char       LCDDATA48;
extern volatile far  struct {
  unsigned S00C6:1;
  unsigned S01C6:1;
  unsigned S02C6:1;
  unsigned S03C6:1;
  unsigned S04C6:1;
  unsigned S05C6:1;
  unsigned S06C6:1;
  unsigned S07C6:1;
} LCDDATA48bits;
extern volatile far  unsigned char       LCDDATA49;
extern volatile far  struct {
  unsigned S08C6:1;
  unsigned S09C6:1;
  unsigned S10C6:1;
  unsigned S11C6:1;
  unsigned S12C6:1;
  unsigned S13C6:1;
  unsigned S14C6:1;
  unsigned S15C6:1;
} LCDDATA49bits;
extern volatile far  unsigned char       LCDDATA50;
extern volatile far  struct {
  unsigned S16C6:1;
  unsigned S17C6:1;
  unsigned S18C6:1;
  unsigned S19C6:1;
  unsigned S20C6:1;
  unsigned S21C6:1;
  unsigned S22C6:1;
  unsigned S23C6:1;
} LCDDATA50bits;
extern volatile far  unsigned char       LCDDATA51;
extern volatile far  struct {
  unsigned S24C6:1;
  unsigned S25C6:1;
  unsigned S26C6:1;
  unsigned S27C6:1;
  unsigned S28C6:1;
  unsigned S29C6:1;
  unsigned S30C6:1;
  unsigned S31C6:1;
} LCDDATA51bits;
extern volatile far  unsigned char       LCDDATA52;
extern volatile far  struct {
  unsigned S32C6:1;
  unsigned S33C6:1;
  unsigned S34C6:1;
  unsigned S35C6:1;
  unsigned S36C6:1;
  unsigned S37C6:1;
  unsigned S38C6:1;
  unsigned S39C6:1;
} LCDDATA52bits;
extern volatile far  unsigned char       LCDDATA53;
extern volatile far  struct {
  unsigned S40C6:1;
  unsigned S41C6:1;
  unsigned S42C6:1;
  unsigned S43C6:1;
  unsigned S44C6:1;
  unsigned S45C6:1;
  unsigned S46C6:1;
  unsigned S47C6:1;
} LCDDATA53bits;
extern volatile far  unsigned char       LCDDATA54;
extern volatile far  struct {
  unsigned S48C6:1;
  unsigned S49C6:1;
  unsigned S50C6:1;
  unsigned S51C6:1;
  unsigned S52C6:1;
  unsigned S53C6:1;
  unsigned S54C6:1;
  unsigned S55C6:1;
} LCDDATA54bits;
extern volatile far  unsigned char       LCDDATA55;
extern volatile far  struct {
  unsigned S56C6:1;
  unsigned S57C6:1;
  unsigned S58C6:1;
  unsigned S59C6:1;
  unsigned S60C6:1;
  unsigned S61C6:1;
  unsigned S62C6:1;
  unsigned S63C6:1;
} LCDDATA55bits;
extern volatile far  unsigned char       LCDDATA56;
extern volatile far  struct {
  unsigned S00C7:1;
  unsigned S01C7:1;
  unsigned S02C7:1;
  unsigned S03C7:1;
  unsigned S04C7:1;
  unsigned S05C7:1;
  unsigned S06C7:1;
  unsigned S07C7:1;
} LCDDATA56bits;
