jonahn/EE478/Lab2/PIC_SOURCES/h/p18f87j94.h
extern volatile far  unsigned char       RTCVALL;
extern volatile far  unsigned char       RTCVALH;
extern volatile far  unsigned char       RTCCAL;
extern volatile far  union {
  struct {
    unsigned CAL:8;
  };
  struct {
    unsigned CAL0:1;
    unsigned CAL1:1;
    unsigned CAL2:1;
    unsigned CAL3:1;
    unsigned CAL4:1;
    unsigned CAL5:1;
    unsigned CAL6:1;
    unsigned CAL7:1;
  };
} RTCCALbits;
extern volatile far  unsigned char       RTCCON1;
extern volatile far  union {
  struct {
    unsigned RTCPTR:2;
    unsigned RTCOE:1;
    unsigned HALFSEC:1;
    unsigned RTCSYNC:1;
    unsigned RTCWREN:1;
    unsigned :1;
    unsigned RTCEN:1;
  };
  struct {
    unsigned RTCPTR0:1;
    unsigned RTCPTR1:1;
  };
} RTCCON1bits;
extern volatile near unsigned char       DMACON1;
extern volatile near union {
  struct {
    unsigned DMAEN:1;
    unsigned DLYINTEN:1;
    unsigned DUPLEX:2;
    unsigned RXINC:1;
    unsigned TXINC:1;
    unsigned SSCON:2;
  };
  struct {
    unsigned :2;
    unsigned DUPLEX0:1;
    unsigned DUPLEX1:1;
    unsigned :2;
    unsigned SSCON0:1;
    unsigned SSCON1:1;
  };
} DMACON1bits;
extern volatile near unsigned char       PIE6;
extern volatile near struct {
  unsigned CMP1IE:1;
  unsigned CMP2IE:1;
  unsigned CMP3IE:1;
  unsigned :1;
  unsigned TX3IE:1;
  unsigned RC3IE:1;
  unsigned TX4IE:1;
  unsigned RC4IE:1;
} PIE6bits;
extern volatile near unsigned char       WPUB;
extern volatile near struct {
  unsigned WPUB0:1;
  unsigned WPUB1:1;
  unsigned WPUB2:1;
  unsigned WPUB3:1;
  unsigned WPUB4:1;
  unsigned WPUB5:1;
  unsigned WPUB6:1;
  unsigned WPUB7:1;
} WPUBbits;
extern volatile near unsigned char       ACTCON;
extern volatile near struct {
  unsigned ACTORSPOL:1;
  unsigned ACTORS:1;
  unsigned ACTLOCKPOL:1;
  unsigned ACTLOCK:1;
  unsigned ACTSRC:1;
  unsigned ACTSIDL:1;
  unsigned :1;
  unsigned ACTEN:1;
} ACTCONbits;
extern volatile near unsigned char       OSCCON4;
extern volatile near union {
  struct {
    unsigned :5;
    unsigned PLLEN:1;
    unsigned CPDIV:2;
  };
  struct {
    unsigned :6;
    unsigned CPDIV0:1;
    unsigned CPDIV1:1;
  };
} OSCCON4bits;
extern volatile near unsigned char       OSCCON3;
extern volatile near union {
  struct {
    unsigned IRCF:3;
  };
  struct {
    unsigned IRCF0:1;
    unsigned IRCF1:1;
    unsigned IRCF2:1;
  };
} OSCCON3bits;
extern volatile near unsigned char       OSCCON2;
extern volatile near struct {
  unsigned :1;
  unsigned SOSCGO:1;
  unsigned POSCEN:1;
  unsigned CF:1;
  unsigned :1;
  unsigned LOCK:1;
  unsigned IOLOCK:1;
  unsigned CLKLOCK:1;
} OSCCON2bits;
extern volatile near unsigned char       BAUDCON;
extern volatile near union {
  struct {
    unsigned ABDEN:1;
    unsigned WUE:1;
    unsigned IREN:1;
    unsigned BRG16:1;
    unsigned TXCKP:1;
    unsigned RXDTP:1;
    unsigned RCIDL:1;
    unsigned ABDOVF:1;
  };
  struct {
    unsigned :4;
    unsigned CKTXP:1;
    unsigned DTRXP:1;
  };
  struct {
    unsigned :4;
    unsigned SCKP:1;
    unsigned :1;
    unsigned RCMT:1;
  };
} BAUDCONbits;
extern volatile near unsigned char       BAUDCON1;
extern volatile near union {
  struct {
    unsigned ABDEN:1;
    unsigned WUE:1;
    unsigned IREN:1;
    unsigned BRG16:1;
    unsigned TXCKP:1;
    unsigned RXDTP:1;
    unsigned RCIDL:1;
    unsigned ABDOVF:1;
  };
  struct {
    unsigned :4;
    unsigned CKTXP:1;
    unsigned DTRXP:1;
  };
  struct {
    unsigned :4;
    unsigned SCKP:1;
    unsigned :1;
    unsigned RCMT:1;
  };
} BAUDCON1bits;
extern volatile near unsigned char       SSP1MSK;
extern volatile near union {
  struct {
    unsigned SSPMSK:8;
  };
  struct {
    unsigned MSK0:1;
    unsigned MSK1:1;
    unsigned MSK2:1;
    unsigned MSK3:1;
    unsigned MSK4:1;
    unsigned MSK5:1;
    unsigned MSK6:1;
    unsigned MSK7:1;
  };
} SSP1MSKbits;
extern volatile near unsigned char       SSP1CON3;
extern volatile near struct {
  unsigned DHEN:1;
  unsigned AHEN:1;
  unsigned SBCDE:1;
  unsigned SDAHT:1;
  unsigned BOEN:1;
  unsigned SCIE:1;
  unsigned PCIE:1;
  unsigned ACKTIM:1;
} SSP1CON3bits;
extern volatile near unsigned char       TXBUF;
extern volatile near union {
  struct {
    unsigned TXBUF:8;
  };
  struct {
    unsigned TXBUF0:1;
    unsigned TXBUF1:1;
    unsigned TXBUF2:1;
    unsigned TXBUF3:1;
    unsigned TXBUF4:1;
    unsigned TXBUF5:1;
    unsigned TXBUF6:1;
    unsigned TXBUF7:1;
  };
} TXBUFbits;
extern volatile near unsigned char       DMABCH;
extern volatile near union {
  struct {
    unsigned DMACNTHB:2;
  };
  struct {
    unsigned BC8:1;
    unsigned BC9:1;
  };
} DMABCHbits;
extern volatile near unsigned char       DMABCL;
extern volatile near union {
  struct {
    unsigned DMACNTLB:8;
  };
  struct {
    unsigned BC0:1;
    unsigned BC1:1;
    unsigned BC2:1;
    unsigned BC3:1;
    unsigned BC4:1;
    unsigned BC5:1;
    unsigned BC6:1;
    unsigned BC7:1;
  };
} DMABCLbits;
extern volatile near unsigned char       RXADDRH;
extern volatile near union {
  struct {
    unsigned DMARCVPTRHB:4;
  };
  struct {
    unsigned RXADDR8:1;
    unsigned RXADDR9:1;
    unsigned RXADDR10:1;
    unsigned RXADDR11:1;
  };
} RXADDRHbits;
extern volatile near unsigned char       RXADDRL;
extern volatile near union {
  struct {
    unsigned DMARCVPTRLB:8;
  };
  struct {
    unsigned RXADDR0:1;
    unsigned RXADDR1:1;
    unsigned RXADDR2:1;
    unsigned RXADDR3:1;
    unsigned RXADDR4:1;
    unsigned RXADDR5:1;
    unsigned RXADDR6:1;
    unsigned RXADDR7:1;
  };
} RXADDRLbits;
extern volatile near unsigned char       TXADDRH;
extern volatile near union {
  struct {
    unsigned DMATXPTRHB:4;
  };
  struct {
    unsigned TXADDR8:1;
    unsigned TXADDR9:1;
    unsigned TXADDR10:1;
    unsigned TXADDR11:1;
  };
} TXADDRHbits;
extern volatile near unsigned char       TXADDRL;
extern volatile near union {
  struct {
    unsigned DMATXPTRLB:8;
  };
  struct {
    unsigned TXADDR0:1;
    unsigned TXADDR1:1;
    unsigned TXADDR2:1;
    unsigned TXADDR3:1;
    unsigned TXADDR4:1;
    unsigned TXADDR5:1;
    unsigned TXADDR6:1;
    unsigned TXADDR7:1;
  };
} TXADDRLbits;
